spartan1991/v_0.2_STM32F103_SIM800L_LCD_PHONE_12.11.2017/LCD5110 (Driver AVR to STM)/n3310.c
#include "stm32f10x.h"       // Добавляем файл описания архитектуры
#include "stm32f10x_rcc.h"   // Добавляем файл описания модулей тактирования
#include "stm32f10x_gpio.h"  // Добавляем файл описания портов ввода-вывода
#include "stdint.h"          // Добавляем файл описания типов данных 
#include "n3310.h"
#include "string.h"
#include "pgmspace.h"

static __IO uint32_t TimingDelay = 0;
void SysTick_Handler(void);
void Delay_US(__IO uint32_t nTime);


#ifndef PROGMEM
        #define PROGMEM
#endif

#ifndef pgm_read_byte
        #define pgm_read_byte(x) *x
#endif

#ifndef AVR
        //#define memcpy_P(...) memcpy(__VA_ARGS__)
#endif

#ifndef PSTR
        #define PSTR(x) x
#endif

// Прототипы приватных функций драйвера

static void LcdSend    ( byte data, LcdCmdData mode );
static void Delay      ( void );

// Кэш в ОЗУ 84*48 бит или 504 байта
static byte  LcdCache [ LCD_CACHE_SIZE ];

// Чтобы не обновлять весь дисплей, а лишь ту часть что изменилась,
// будем отмечать две границы кэша где произошли изменения. Затем
// можно копировать эту часть кэша между границами в ОЗУ дисплея.
static int   LoWaterMark;   // нижняя граница
static int   HiWaterMark;   // верхняя граница

// Указатель для работы с LcdCache[]
static int   LcdCacheIdx;

// Флаг изменений кэша
static byte UpdateLcd;

/*
 * Имя                   :  LcdInit
 * Описание              :  Производит инициализацию порта и SPI МК, контроллера LCD
 * Аргумент(ы)           :  Нет
 * Возвращаемое значение :  Нет
 */
void LcdInit ( void ){

	// Pull-up на вывод подключенный к reset дисплея
	LCD_RST_HIGH;

	// Устанавливаем нужные биты порта на выход
	//LCD_DDR |= _BV( LCD_RST_PIN ) | _BV( LCD_DC_PIN ) | _BV( LCD_CE_PIN ) | _BV( SPI_MOSI_PIN ) | _BV( SPI_CLK_PIN );

	LCD_RST_HIGH;
	LCD_DC_HIGH;
	LCD_CE_HIGH;
	LCD_Din_HIGH;
	LCD_Clk_HIGH;

	// Некалиброванная задержка
	Delay();

	// Дергаем reset
	LCD_RST_LOW;  //LCD_PORT &= ~( _BV( LCD_RST_PIN ));
	Delay();
	LCD_RST_HIGH;  //LCD_PORT |= _BV ( LCD_RST_PIN );

	// Активируем SPI:
	// без прерываний, старший бит первый, режим мастера, CPOL->0, CPHA->0, Clk/4
	// SPCR = 0x50;

	// Отключаем LCD контроллер - высокий уровень на SCE
	LCD_CE_HIGH;  //LCD_PORT |= _BV( LCD_CE_PIN );

	// Отправляем команды дисплею

	    LcdSend( 0x21, LCD_CMD ); // Включаем расширенный набор команд (LCD Extended Commands)
	    LcdSend( 0xC8, LCD_CMD ); // Установка контрастности (LCD Vop)
	    LcdSend( 0x06, LCD_CMD ); // Установка температурного коэффициента (Temp coefficent)
	    LcdSend( 0x13, LCD_CMD ); // Настройка питания (LCD bias mode 1:48)
	    LcdSend( 0x20, LCD_CMD ); // Включаем стандартный набор команд и горизонтальную адресацию (LCD Standard Commands,Horizontal addressing mode)
	    LcdSend( 0x0C, LCD_CMD ); // Нормальный режим (LCD in normal mode)

	// Первичная очистка дисплея
	LcdClear();
	LcdUpdate();
}

/*
 * Имя                   :  LcdClear
 * Описание              :  Очищает дисплей. Далее необходимо выполнить LcdUpdate
 * Аргумент(ы)           :  Нет
 * Возвращаемое значение :  Нет
 */
void LcdClear ( void ){
	
//    // Очистка кэша дисплея
//    int i;
//    for ( i = 0; i < LCD_CACHE_SIZE; i++ )
//    {
//        LcdCache[i] = 0x00;
//    }

    // Оптимизация от Jakub Lasinski (March 14 2009)
    memset( LcdCache, 0x00, LCD_CACHE_SIZE );
    
    // Сброс указателей границ в максимальное значение
    LoWaterMark = 0;
    HiWaterMark = LCD_CACHE_SIZE - 1;

    // Установка флага изменений кэша
    UpdateLcd = TRUE;
}

/*
 * Имя                   :  LcdUpdate
 * Описание              :  Копирует кэш в ОЗУ дисплея
 * Аргумент(ы)           :  Нет
 * Возвращаемое значение :  Нет
 */
void LcdUpdate (void){
	
    int i;

    if ( LoWaterMark < 0 )
        LoWaterMark = 0;
    else if ( LoWaterMark >= LCD_CACHE_SIZE )
        LoWaterMark = LCD_CACHE_SIZE - 1;

    if ( HiWaterMark < 0 )
        HiWaterMark = 0;
    else if ( HiWaterMark >= LCD_CACHE_SIZE )
        HiWaterMark = LCD_CACHE_SIZE - 1;

    #ifdef CHINA_LCD  // Алгоритм для китайского ЖК из нестандартным контроллером

        byte x,y;

        // 102 x 64 - таково предполагаемое разрешение буфера китайского ЖК, при чем
        // память буфера отображается на дисплей со сдвигом вверх на 3 пикселя.
        // Поэтому выводим картинку ниже - начиная с второй строки y+1, а потом
        // сдвинем вверх (опять таки фича китайца, полезная в данном случае)
                
        x = LoWaterMark % LCD_X_RES;      // Устанавливаем начальный адрес x
        LcdSend( 0x80 | x, LCD_CMD );     // относительно нижней границы LoWaterMark
        
        y = LoWaterMark / LCD_X_RES + 1;  // Устанавливаем начальный адрес y+1
        LcdSend( 0x40 | y, LCD_CMD );     // относительно нижней границы LoWaterMark

        for ( i = LoWaterMark; i <= HiWaterMark; i++ )
        {
            // передаем данные в буфер дисплея
            LcdSend( LcdCache[i], LCD_DATA );
            
            x++;                 // заодно подсчитываем координату x, чтобы вовремя перейти на новую строку
            if (x >= LCD_X_RES)  // если вышли за предел, то переходим на следующую строку (x=0; y++)
            {
                // проще говоря, чтобы верно заполнить нужную часть нестандартного буфера,
                // придется явно указывать требуемый адрес, иначе все поплывет :)
                x=0;                
                LcdSend( 0x80, LCD_CMD );
                y++;
                LcdSend( 0x40 | y, LCD_CMD );
            }
        }

        LcdSend( 0x21, LCD_CMD );    // Включаем расширенный набор команд
        LcdSend( 0x45, LCD_CMD );    // Сдвигаем картинку на 5 пикселей вверх (нестандартная команда китайца, оригинал её игнорирует)
        LcdSend( 0x20, LCD_CMD );    // Включаем стандартный набор команд и горизонтальную адресацию

    #else  // Алгоритм для оригинального дисплея

        // Устанавливаем начальный адрес в соответствии к LoWaterMark
        LcdSend( 0x80 | ( LoWaterMark % LCD_X_RES ), LCD_CMD );
        LcdSend( 0x40 | ( LoWaterMark / LCD_X_RES ), LCD_CMD );

