spartan1991/v_0.2_STM32F103_SIM800L_LCD_PHONE_12.11.2017/LCD5110 (Driver AVR to STM)/n3310.c
    byte tmpIdxX,tmpIdxY;
    byte response;

    // Проверка границ
    if ( ( x1 >= LCD_X_RES) || ( y1 >= LCD_Y_RES) ) return OUT_OF_BORDER;

		// Рисование линий
    if ( y2 > y1 && x2 > x1)
		{
			  for ( tmpIdxY = y1; tmpIdxY <= y2; tmpIdxY++ )
				{
						for ( tmpIdxX = x1; tmpIdxX < x2; tmpIdxX++ )
						{
								response = LcdPixel( tmpIdxX, tmpIdxY, mode );
								if(response)
                return response;
						}
				}
				// Установка флага изменений кэша
				UpdateLcd = TRUE;
				return OK;
		}
		
		else return 0;
}

/*
 * Имя                   :  LcdBars
 * Описание              :  Рисует группу закрашенных прямоугольников (в режиме PIXEL_ON)
 * Аргумент(ы)           :  data[]     -> данные которые нужно отобразить
 *                          numbBars   -> количество прямоугольников
 *                          width      -> ширина (в пикселях)
 *                          multiplier -> множитель для высоты
 * Возвращаемое значение :  смотри возвращаемое значение в n3310lcd.h
 * Примечание            :  Пожалуйста проверьте значения EMPTY_SPACE_BARS, BAR_X, BAR_Y в n3310.h
 * Пример                :  byte example[5] = {1, 2, 3, 4, 5};
 *                          LcdBars(example, 5, 3, 2);
 */
byte LcdBars ( byte data[], byte numbBars, byte width, byte multiplier ){
	
    byte b;
    byte tmpIdx = 0;
    byte response;

    for ( b = 0;  b < numbBars ; b++ )
    {
        // Защита от выхода за пределы
        if ( tmpIdx > LCD_X_RES - 1 ) return OUT_OF_BORDER;

        // Расчет значения x
        tmpIdx = ((width + EMPTY_SPACE_BARS) * b) + BAR_X;

        // Рисуем один прямоугольник
        response = LcdSingleBar( tmpIdx, BAR_Y, data[b] * multiplier, width, PIXEL_ON);
        if(response == OUT_OF_BORDER)
            return response;
    }

    // Установка флага изменений кэша
    UpdateLcd = TRUE;
    return OK;

}

/*
 * Имя                   :  LcdRect
 * Описание              :  Рисует незакрашенный прямоугольник
 * Аргумент(ы)           :  x1    -> абсолютная координата x левого верхнего угла
 *                          y1    -> абсолютная координата y левого верхнего угла
 *                          x2    -> абсолютная координата x правого нижнего угла
 *                          y2    -> абсолютная координата y правого нижнего угла
 *                          mode  -> Off, On или Xor. Смотри enum в n3310.h
 * Возвращаемое значение :  смотри возвращаемое значение в n3310lcd.h
 */
byte LcdRect ( byte x1, byte y1, byte x2, byte y2, LcdPixelMode mode ){
	
    byte tmpIdx;

    // Проверка границ
    if ( ( x1 >= LCD_X_RES) ||  ( x2 >= LCD_X_RES) || ( y1 >= LCD_Y_RES) || ( y2 >= LCD_Y_RES) )
        return OUT_OF_BORDER;

    if ( ( x2 > x1 ) && ( y2 > y1 ) )
    {
        // Рисуем горизонтальные линии
        for ( tmpIdx = x1; tmpIdx <= x2; tmpIdx++ )
        {
            LcdPixel( tmpIdx, y1, mode );
            LcdPixel( tmpIdx, y2, mode );
        }

        // Рисуем вертикальные линии
        for ( tmpIdx = y1; tmpIdx <= y2; tmpIdx++ )
        {
            LcdPixel( x1, tmpIdx, mode );
            LcdPixel( x2, tmpIdx, mode );
        }

        // Установка флага изменений кэша
        UpdateLcd = TRUE;
    }
    return OK;
}

/*
 * Имя                   :  LcdImage
 * Описание              :  Рисует картинку из массива сохраненного в Flash ROM
 * Аргумент(ы)           :  Указатель на массив картинки
 * Возвращаемое значение :  Нет
 */
void LcdImage(const byte *imageData){
	
//    // Инициализация указателя кэша
//    LcdCacheIdx = 0;
//    // В пределах кэша
//    for ( LcdCacheIdx = 0; LcdCacheIdx < LCD_CACHE_SIZE; LcdCacheIdx++ )
//    {
//        // Копируем данные из массива в кэш
//        LcdCache[LcdCacheIdx] = pgm_read_byte( imageData++ );
//    }
    
    // Оптимизация от Jakub Lasinski (March 14 2009)
    memcpy_P( LcdCache, imageData, LCD_CACHE_SIZE );  // Тоже самое что и выше, но занимает меньше памяти и быстрее выполняется
    
    // Сброс указателей границ в максимальное значение
    LoWaterMark = 0;
    HiWaterMark = LCD_CACHE_SIZE - 1;

    // Установка флага изменений кэша
    UpdateLcd = TRUE;
}

/*
 * Имя                   :  IntToString
 * Описание              :  Преобразование числа(int) в строку
 * Аргумент(ы)           :  Переменная (указатель на переменную)
 * Возвращаемое значение :  Нет
 */
unsigned char SYMBOLS[DIG_BASE] = {'0','1','2','3','4','5','6','7','8','9'}; // Массив символов, соответствующих цифрам выбранной системы
unsigned char out[MAX_SIZE];  // Выходной массив символов

void IntToString(unsigned int NUM){
	
	 int i, m;
	
	 for(i=MAX_SIZE-1; i>=0; i--)
	 {
		 m = NUM % DIG_BASE;

		 if((NUM==0)&&(i!=(MAX_SIZE-1)))
		 {
			 out[i] = SPACE_CHAR;
		 }

		 else
		 {
			 out[i] = SYMBOLS[m];
			 NUM /= DIG_BASE;
		 }
	 }
	 LcdFStr(FONT_1X,(uint8_t*)out);
 }

 /*
 * Имя                   :  RangeCheck
 * Описание              :  Проверка диапазона
 * Аргумент(ы)           :  min    -> нижний предел
 *                       :  max    -> верхний предел
 *                       :  value  -> проверяемое значение
 * Возвращаемое значение :  Значение
 */
 byte RangeCheck(byte min, byte max, byte value){
	 
	 if(value < min) return min;
	 if(value > max) return max; 
	 
	 return value;
 }
 
 /*
 * Имя                   :  LcdProgressBar
 * Описание              :  Выводит ProgressBar
 * Аргумент(ы)           :  baseX   -> абсолютная координата x левого верхнего угла
 *                       :  baseY   -> абсолютная координата y левого верхнего угла
 *                       :  width   -> длина ProgressBar-а
 *                       :  height  -> высота ProgressBar-а
 *                       :  rotate  -> 0 - горизонтальное заполнение \ 1 - вертикальное
 *                       :  gap     -> (число) отступ заполнения от рамки ProgressBar-а
 *                       :  mode    -> Off, On или Xor. Смотри enum в n3310.h 
 *                       :  percent -> процент заполнения ProgressBar-а
 * Возвращаемое значение :  возвращает текущий процент
 */
 int LcdProgressBar(byte baseX, byte baseY, byte width, byte height, byte rotate, byte gap, LcdPixelMode mode, byte percent){
	 
	 byte barPercent = RangeCheck(0, 100, percent);
	 byte x1, y1, x2, y2;
	 float result;
	 
	 LcdRect(baseX, baseY, baseX+width, baseY+height, mode);
	 
	 switch(rotate){
		 
		 case 0: {
		 
			 result = ((float)(width-gap*2)/100)*barPercent;
			 
			 x1 = baseX+gap;
	     y1 = baseY+gap;
	     x2 = x1+result;
	     y2 = (baseY+height)-gap;
			 
			 if(barPercent==100) ++x2;
			 LcdSingleBar(x1, y1, x2, y2, mode); 
		 }break;
		 
		 case 1: {

			 result = ((float)(height-gap*2)/100)*barPercent;
			 
			 x1 = baseX+gap;
			 x2 = (x1+width)-gap*2+1;
			 y2 = (baseY+height)-gap;
			 y1 = (y2-result);
	     
			 
			 LcdSingleBar(x1, y1, x2, y2, mode); 
		 }break;
	 }
	 
	 return barPercent;
 }
 
 /*
 * Имя                   :  LcdMouse
 * Описание              :  Выводит указатель мыши
 * Аргумент(ы)           :         X    -> координата X вершины указателя
 *                       :         Y    -> координата Y вершины указателя
 *                       :  mouseAction -> действие\нажатие
 * Возвращаемое значение :  
 */
 void LcdMouse(byte x, byte y, byte action, byte size, LcdPixelMode mode){
	 
	 LcdLine(x, y, x+size, y+1, mode);
	 LcdLine(x, y, (x+1)+size, (y+1)+size, mode);
	 LcdLine(x, y, x+1, y+size, mode);
 }
